ChibiOS/ChibiOS-Contrib/os/common/ext/CMSIS/ArteryTek/AT32F415/at32f415cx.h
typedef struct
{
  __IO uint32_t PWRCTRL;          /*!< SDIO power control register,                 Address offset: 0x00        */
  __IO uint32_t CLKCTRL;          /*!< SDIO clock control register,                 Address offset: 0x04        */
  __IO uint32_t ARG;              /*!< SDIO argument register,                      Address offset: 0x08        */
  __IO uint32_t CMD;              /*!< SDIO command register,                       Address offset: 0x0C        */
  __I  uint32_t RSPCMD;           /*!< SDIO command response register,              Address offset: 0x10        */
  __I  uint32_t RSP1;             /*!< SDIO response register 1,                    Address offset: 0x14        */
  __I  uint32_t RSP2;             /*!< SDIO response register 2,                    Address offset: 0x18        */
  __I  uint32_t RSP3;             /*!< SDIO response register 3,                    Address offset: 0x1C        */
  __I  uint32_t RSP4;             /*!< SDIO response register 4,                    Address offset: 0x20        */
  __IO uint32_t DTTMR;            /*!< SDIO data timer register,                    Address offset: 0x24        */
  __IO uint32_t DTLEN;            /*!< SDIO data length register,                   Address offset: 0x28        */
  __IO uint32_t DTCTRL;           /*!< SDIO data control register,                  Address offset: 0x2C        */
  __I  uint32_t DTCNTR;           /*!< SDIO data counter register,                  Address offset: 0x30        */
  __I  uint32_t STS;              /*!< SDIO status register,                        Address offset: 0x34        */
  __IO uint32_t INTCLR;           /*!< SDIO clear interrupt register,               Address offset: 0x38        */
  __IO uint32_t INTEN;            /*!< SDIO interrupt mask register,                Address offset: 0x3C        */
  uint32_t      RESERVED0[2];     /*!< Reserved,                                    Address offset: 0x40 ~ 0x44 */
  __I  uint32_t BUFCNTR;          /*!< SDIO BUF counter register,                   Address offset: 0x48        */
  uint32_t      RESERVED1[13];    /*!< Reserved,                                    Address offset: 0x4C ~ 0x7C */
  __IO uint32_t BUF;              /*!< SDIO data BUF register,                      Address offset: 0x80        */
} SDIO_TypeDef;

/**
  * @brief Serial Peripheral Interface
  */

typedef struct
{
  __IO uint32_t CTRL1;      /*!< SPI control register 1,                      Address offset: 0x00 */
  __IO uint32_t CTRL2;      /*!< SPI control register 2,                      Address offset: 0x04 */
  __IO uint32_t STS;        /*!< SPI status register,                         Address offset: 0x08 */
  __IO uint32_t DT;         /*!< SPI data register,                           Address offset: 0x0C */
  __IO uint32_t CPOLY;      /*!< SPI CRC register,                            Address offset: 0x10 */
  __IO uint32_t RCRC;       /*!< SPI receive CRC register,                    Address offset: 0x14 */
  __IO uint32_t TCRC;       /*!< SPI transmit CRC register,                   Address offset: 0x18 */
  __IO uint32_t I2SCTRL;    /*!< SPI_I2S configuration register,              Address offset: 0x1C */
  __IO uint32_t I2SCLKP;    /*!< SPI_I2S prescaler register,                  Address offset: 0x20 */
} SPI_TypeDef;

/**
  * @brief TMR Timers
  */

typedef struct
{
  __IO uint32_t CTRL1;      /*!< TMR control register 1,                      Address offset: 0x00 */
  __IO uint32_t CTRL2;      /*!< TMR control register 2,                      Address offset: 0x04 */
  __IO uint32_t STCTRL;     /*!< TMR slave timer control register,            Address offset: 0x08 */
  __IO uint32_t IDEN;       /*!< TMR DMA/interrupt enable register,           Address offset: 0x0C */
  __IO uint32_t ISTS;       /*!< TMR interrupt status register,               Address offset: 0x10 */
  __IO uint32_t SWEVT;      /*!< TMR software event register,                 Address offset: 0x14 */
  __IO uint32_t CM1;        /*!< TMR channel mode register 1,                 Address offset: 0x18 */
  __IO uint32_t CM2;        /*!< TMR channel mode register 2,                 Address offset: 0x1C */
  __IO uint32_t CCTRL;      /*!< TMR channel control register,                Address offset: 0x20 */
  __IO uint32_t CVAL;       /*!< TMR counter value register,                  Address offset: 0x24 */
  __IO uint32_t DIV;        /*!< TMR division value register,                 Address offset: 0x28 */
  __IO uint32_t PR;         /*!< TMR period register,                         Address offset: 0x2C */
  __IO uint32_t RPR;        /*!< TMR repetition period register,              Address offset: 0x30 */
  __IO uint32_t C1DT;       /*!< TMR channel 1 data register,                 Address offset: 0x34 */
  __IO uint32_t C2DT;       /*!< TMR channel 2 data register,                 Address offset: 0x38 */
  __IO uint32_t C3DT;       /*!< TMR channel 3 data register,                 Address offset: 0x3C */
  __IO uint32_t C4DT;       /*!< TMR channel 4 data register,                 Address offset: 0x40 */
  __IO uint32_t BRK;        /*!< TMR brake register,                          Address offset: 0x44 */
  __IO uint32_t DMACTRL;    /*!< TMR DMA control register,                    Address offset: 0x48 */
  __IO uint32_t DMADT;      /*!< TMR DMA data register,                       Address offset: 0x4C */
} TMR_TypeDef;

/**
  * @brief Universal Synchronous Asynchronous Receiver Transmitter
  */

typedef struct
{
  __IO uint32_t STS;      /*!< USART status register,                       Address offset: 0x00 */
  __IO uint32_t DT;       /*!< USART data register,                         Address offset: 0x04 */
  __IO uint32_t BAUDR;    /*!< USART baud rate register,                    Address offset: 0x08 */
  __IO uint32_t CTRL1;    /*!< USART control register 1,                    Address offset: 0x0C */
  __IO uint32_t CTRL2;    /*!< USART control register 2,                    Address offset: 0x10 */
  __IO uint32_t CTRL3;    /*!< USART control register 3,                    Address offset: 0x14 */
  __IO uint32_t GDIV;     /*!< USART guard time and divider register,       Address offset: 0x18 */
} USART_TypeDef;

/**
  * @brief WATCHDOG Timer
  */

typedef struct
{
  __IO uint32_t CMD;    /*!< WDT command register,                        Address offset: 0x00 */
  __IO uint32_t DIV;    /*!< WDT divider register,                        Address offset: 0x04 */
  __IO uint32_t RLD;    /*!< WDT reload register,                         Address offset: 0x08 */
  __IO uint32_t STS;    /*!< WDT status register,                         Address offset: 0x0C */
} WDT_TypeDef;

/**
  * @brief Window WATCHDOG Timer
  */

typedef struct
{
  __IO uint32_t CTRL;    /*!< WWDT control register,                       Address offset: 0x00 */
  __IO uint32_t CFG;     /*!< WWDT configuration register,                 Address offset: 0x04 */
  __IO uint32_t STS;     /*!< WWDT status register,                        Address offset: 0x08 */
} WWDT_TypeDef;

/**
  * @}
  */

/** @addtogroup Peripheral_memory_map
  * @{
  */

#define FLASH_BASE                   0x08000000U                     /*!< FLASH base address in the alias region         */
#define FLASH_BANK1_END              0x0803FFFFU                     /*!< FLASH end address of bank 1                    */
#define SRAM_BASE                    0x20000000U                     /*!< SRAM base address in the alias region          */
#define PERIPH_BASE                  0x40000000U                     /*!< Peripheral base address in the alias region    */

#define SRAM_BB_BASE                 0x22000000U                     /*!< SRAM base address in the bit-band region       */
#define PERIPH_BB_BASE               0x42000000U                     /*!< Peripheral base address in the bit-band region */

/*!< Peripheral memory map */
#define APB1PERIPH_BASE              PERIPH_BASE                     /*!< APB1 base address                              */
#define APB2PERIPH_BASE              (PERIPH_BASE + 0x00010000U)     /*!< APB2 base address                              */
#define AHBPERIPH_BASE               (PERIPH_BASE + 0x00020000U)     /*!< AHB base address                               */

#define TMR2_BASE                    (APB1PERIPH_BASE + 0x00000000U) /*!< TMR2 base address                              */
#define TMR3_BASE                    (APB1PERIPH_BASE + 0x00000400U) /*!< TMR3 base address                              */
#define TMR4_BASE                    (APB1PERIPH_BASE + 0x00000800U) /*!< TMR4 base address                              */
#define TMR5_BASE                    (APB1PERIPH_BASE + 0x00000C00U) /*!< TMR5 base address                              */
#define CMP_BASE                     (APB1PERIPH_BASE + 0x00002400U) /*!< CMP base address                               */
#define ERTC_BASE                    (APB1PERIPH_BASE + 0x00002800U) /*!< ERTC base address                              */
#define WWDT_BASE                    (APB1PERIPH_BASE + 0x00002C00U) /*!< WWDT base address                              */
#define WDT_BASE                     (APB1PERIPH_BASE + 0x00003000U) /*!< WDT base address                               */
#define SPI2_BASE                    (APB1PERIPH_BASE + 0x00003800U) /*!< SPI2 base address                              */
#define USART2_BASE                  (APB1PERIPH_BASE + 0x00004400U) /*!< USART2 base address                            */
#define USART3_BASE                  (APB1PERIPH_BASE + 0x00004800U) /*!< USART3 base address                            */
#define I2C1_BASE                    (APB1PERIPH_BASE + 0x00005400U) /*!< I2C1 base address                              */
#define I2C2_BASE                    (APB1PERIPH_BASE + 0x00005800U) /*!< I2C2 base address                              */
#define CAN1_BASE                    (APB1PERIPH_BASE + 0x00006400U) /*!< CAN1 base address                              */
#define PWC_BASE                     (APB1PERIPH_BASE + 0x00007000U) /*!< PWC base address                               */

