ChibiOS/ChibiOS-Contrib/os/common/ext/CMSIS/ArteryTek/AT32F415/at32f415cx.h
/*!< APB1DIV configuration */
#define CRM_CFG_APB1DIV_Pos                 (8U)
#define CRM_CFG_APB1DIV_Msk                 (0x7U << CRM_CFG_APB1DIV_Pos)           /*!< 0x00000700 */
#define CRM_CFG_APB1DIV                     CRM_CFG_APB1DIV_Msk                     /*!< APB1DIV[2:0] bits (APB1 division) */
#define CRM_CFG_APB1DIV_0                   (0x1U << CRM_CFG_APB1DIV_Pos)           /*!< 0x00000100 */
#define CRM_CFG_APB1DIV_1                   (0x2U << CRM_CFG_APB1DIV_Pos)           /*!< 0x00000200 */
#define CRM_CFG_APB1DIV_2                   (0x4U << CRM_CFG_APB1DIV_Pos)           /*!< 0x00000400 */

#define CRM_CFG_APB1DIV_DIV1                0x00000000U                             /*!< HCLK is not divided */
#define CRM_CFG_APB1DIV_DIV2                0x00000400U                             /*!< HCLK is divided by 2 */
#define CRM_CFG_APB1DIV_DIV4                0x00000500U                             /*!< HCLK is divided by 4 */
#define CRM_CFG_APB1DIV_DIV8                0x00000600U                             /*!< HCLK is divided by 8 */
#define CRM_CFG_APB1DIV_DIV16               0x00000700U                             /*!< HCLK is divided by 16 */

/*!< APB2DIV configuration */
#define CRM_CFG_APB2DIV_Pos                 (11U)
#define CRM_CFG_APB2DIV_Msk                 (0x7U << CRM_CFG_APB2DIV_Pos)           /*!< 0x00003800 */
#define CRM_CFG_APB2DIV                     CRM_CFG_APB2DIV_Msk                     /*!< APB2DIV[2:0] bits (APB2 division) */
#define CRM_CFG_APB2DIV_0                   (0x1U << CRM_CFG_APB2DIV_Pos)           /*!< 0x00000800 */
#define CRM_CFG_APB2DIV_1                   (0x2U << CRM_CFG_APB2DIV_Pos)           /*!< 0x00001000 */
#define CRM_CFG_APB2DIV_2                   (0x4U << CRM_CFG_APB2DIV_Pos)           /*!< 0x00002000 */

#define CRM_CFG_APB2DIV_DIV1                0x00000000U                             /*!< HCLK is not divided */
#define CRM_CFG_APB2DIV_DIV2                0x00002000U                             /*!< HCLK is divided by 2 */
#define CRM_CFG_APB2DIV_DIV4                0x00002800U                             /*!< HCLK is divided by 4 */
#define CRM_CFG_APB2DIV_DIV8                0x00003000U                             /*!< HCLK is divided by 8 */
#define CRM_CFG_APB2DIV_DIV16               0x00003800U                             /*!< HCLK is divided by 16 */

/*!< ADCDIV configuration */
#define CRM_CFG_ADCDIV_Msk                  ((0x3U << 14) | (0x1U << 28))           /*!< 0x1000C000 */
#define CRM_CFG_ADCDIV                      CRM_CFG_ADCDIV_Msk                      /*!< ADCDIV[2:0] bits (ADC division) */
#define CRM_CFG_ADCDIV_0                    (0x1U << 14)                            /*!< 0x00004000 */
#define CRM_CFG_ADCDIV_1                    (0x2U << 14)                            /*!< 0x00008000 */
#define CRM_CFG_ADCDIV_2                    (0x1U << 28)                            /*!< 0x10000000 */

#define CRM_CFG_ADCDIV_DIV2                 0x00000000U                             /*!< PCLK/2 */
#define CRM_CFG_ADCDIV_DIV4                 0x00004000U                             /*!< PCLK/4 */
#define CRM_CFG_ADCDIV_DIV6                 0x00008000U                             /*!< PCLK/6 */
#define CRM_CFG_ADCDIV_DIV8                 0x0000C000U                             /*!< PCLK/8 */
#define CRM_CFG_ADCDIV_DIV12                0x10004000U                             /*!< PCLK/12 */
#define CRM_CFG_ADCDIV_DIV16                0x1000C000U                             /*!< PCLK/16 */

#define CRM_CFG_PLLRCS_Pos                  (16U)
#define CRM_CFG_PLLRCS_Msk                  (0x1U << CRM_CFG_PLLRCS_Pos)            /*!< 0x00010000 */
#define CRM_CFG_PLLRCS                      CRM_CFG_PLLRCS_Msk                      /*!< PLL entry clock select */

#define CRM_CFG_PLLHEXTDIV_Pos              (17U)
#define CRM_CFG_PLLHEXTDIV_Msk              (0x1U << CRM_CFG_PLLHEXTDIV_Pos)        /*!< 0x00020000 */
#define CRM_CFG_PLLHEXTDIV                  CRM_CFG_PLLHEXTDIV_Msk                  /*!< HEXT division selection for PLL entry clock */

/*!< PLLMULT configuration */
#define CRM_CFG_PLLMULT_Msk                 ((0xFU << 18) | (0x3U << 29))           /*!< 0x603C0000 */
#define CRM_CFG_PLLMULT                     CRM_CFG_PLLMULT_Msk                     /*!< PLLMULT[5:0] bits (PLL multiplication factor) */
#define CRM_CFG_PLLMULT_0                   (0x1U << 18)                            /*!< 0x00040000 */
#define CRM_CFG_PLLMULT_1                   (0x2U << 18)                            /*!< 0x00080000 */
#define CRM_CFG_PLLMULT_2                   (0x4U << 18)                            /*!< 0x00100000 */
#define CRM_CFG_PLLMULT_3                   (0x8U << 18)                            /*!< 0x00200000 */
#define CRM_CFG_PLLMULT_4                   (0x1U << 29)                            /*!< 0x20000000 */
#define CRM_CFG_PLLMULT_5                   (0x2U << 29)                            /*!< 0x40000000 */

#define CRM_CFG_PLLMULT_MULT2               0x00000000U                             /*!< PLL input clock * 2 */
#define CRM_CFG_PLLMULT_MULT3_Pos           (18U)
#define CRM_CFG_PLLMULT_MULT3_Msk           (0x1U << CRM_CFG_PLLMULT_MULT3_Pos)     /*!< 0x00040000 */
#define CRM_CFG_PLLMULT_MULT3               CRM_CFG_PLLMULT_MULT3_Msk               /*!< PLL input clock * 3 */
#define CRM_CFG_PLLMULT_MULT4_Pos           (19U)
#define CRM_CFG_PLLMULT_MULT4_Msk           (0x1U << CRM_CFG_PLLMULT_MULT4_Pos)     /*!< 0x00080000 */
#define CRM_CFG_PLLMULT_MULT4               CRM_CFG_PLLMULT_MULT4_Msk               /*!< PLL input clock * 4 */
#define CRM_CFG_PLLMULT_MULT5_Pos           (18U)
#define CRM_CFG_PLLMULT_MULT5_Msk           (0x3U << CRM_CFG_PLLMULT_MULT5_Pos)     /*!< 0x000C0000 */
#define CRM_CFG_PLLMULT_MULT5               CRM_CFG_PLLMULT_MULT5_Msk               /*!< PLL input clock * 5 */
#define CRM_CFG_PLLMULT_MULT6_Pos           (20U)
#define CRM_CFG_PLLMULT_MULT6_Msk           (0x1U << CRM_CFG_PLLMULT_MULT6_Pos)     /*!< 0x00100000 */
#define CRM_CFG_PLLMULT_MULT6               CRM_CFG_PLLMULT_MULT6_Msk               /*!< PLL input clock * 6 */
#define CRM_CFG_PLLMULT_MULT7_Pos           (18U)
#define CRM_CFG_PLLMULT_MULT7_Msk           (0x5U << CRM_CFG_PLLMULT_MULT7_Pos)     /*!< 0x00140000 */
#define CRM_CFG_PLLMULT_MULT7               CRM_CFG_PLLMULT_MULT7_Msk               /*!< PLL input clock * 7 */
#define CRM_CFG_PLLMULT_MULT8_Pos           (19U)
#define CRM_CFG_PLLMULT_MULT8_Msk           (0x3U << CRM_CFG_PLLMULT_MULT8_Pos)     /*!< 0x00180000 */
#define CRM_CFG_PLLMULT_MULT8               CRM_CFG_PLLMULT_MULT8_Msk               /*!< PLL input clock * 8 */
#define CRM_CFG_PLLMULT_MULT9_Pos           (18U)
#define CRM_CFG_PLLMULT_MULT9_Msk           (0x7U << CRM_CFG_PLLMULT_MULT9_Pos)     /*!< 0x001C0000 */
#define CRM_CFG_PLLMULT_MULT9               CRM_CFG_PLLMULT_MULT9_Msk               /*!< PLL input clock * 9 */
#define CRM_CFG_PLLMULT_MULT10_Pos          (21U)
#define CRM_CFG_PLLMULT_MULT10_Msk          (0x1U << CRM_CFG_PLLMULT_MULT10_Pos)    /*!< 0x00200000 */
#define CRM_CFG_PLLMULT_MULT10              CRM_CFG_PLLMULT_MULT10_Msk              /*!< PLL input clock * 10 */
#define CRM_CFG_PLLMULT_MULT11_Pos          (18U)
#define CRM_CFG_PLLMULT_MULT11_Msk          (0x9U << CRM_CFG_PLLMULT_MULT11_Pos)    /*!< 0x00240000 */
#define CRM_CFG_PLLMULT_MULT11              CRM_CFG_PLLMULT_MULT11_Msk              /*!< PLL input clock * 11 */
#define CRM_CFG_PLLMULT_MULT12_Pos          (19U)
#define CRM_CFG_PLLMULT_MULT12_Msk          (0x5U << CRM_CFG_PLLMULT_MULT12_Pos)    /*!< 0x00280000 */
#define CRM_CFG_PLLMULT_MULT12              CRM_CFG_PLLMULT_MULT12_Msk              /*!< PLL input clock * 12 */
#define CRM_CFG_PLLMULT_MULT13_Pos          (18U)
#define CRM_CFG_PLLMULT_MULT13_Msk          (0xBU << CRM_CFG_PLLMULT_MULT13_Pos)    /*!< 0x002C0000 */
#define CRM_CFG_PLLMULT_MULT13              CRM_CFG_PLLMULT_MULT13_Msk              /*!< PLL input clock * 13 */
#define CRM_CFG_PLLMULT_MULT14_Pos          (20U)
#define CRM_CFG_PLLMULT_MULT14_Msk          (0x3U << CRM_CFG_PLLMULT_MULT14_Pos)    /*!< 0x00300000 */
#define CRM_CFG_PLLMULT_MULT14              CRM_CFG_PLLMULT_MULT14_Msk              /*!< PLL input clock * 14 */
#define CRM_CFG_PLLMULT_MULT15_Pos          (18U)
#define CRM_CFG_PLLMULT_MULT15_Msk          (0xDU << CRM_CFG_PLLMULT_MULT15_Pos)    /*!< 0x00340000 */
#define CRM_CFG_PLLMULT_MULT15              CRM_CFG_PLLMULT_MULT15_Msk              /*!< PLL input clock * 15 */
#define CRM_CFG_PLLMULT_MULT16_Pos          (19U)
#define CRM_CFG_PLLMULT_MULT16_Msk          (0x7U << CRM_CFG_PLLMULT_MULT16_Pos)    /*!< 0x00380000 */
#define CRM_CFG_PLLMULT_MULT16              CRM_CFG_PLLMULT_MULT16_Msk              /*!< PLL input clock * 16 */
#define CRM_CFG_PLLMULT_MULT17              0x20000000U                             /*!< PLL input clock * 17 */
#define CRM_CFG_PLLMULT_MULT18              0x20040000U                             /*!< PLL input clock * 18 */
#define CRM_CFG_PLLMULT_MULT19              0x20080000U                             /*!< PLL input clock * 19 */
#define CRM_CFG_PLLMULT_MULT20              0x200C0000U                             /*!< PLL input clock * 20 */
#define CRM_CFG_PLLMULT_MULT21              0x20100000U                             /*!< PLL input clock * 21 */
#define CRM_CFG_PLLMULT_MULT22              0x20140000U                             /*!< PLL input clock * 22 */
#define CRM_CFG_PLLMULT_MULT23              0x20180000U                             /*!< PLL input clock * 23 */
#define CRM_CFG_PLLMULT_MULT24              0x201C0000U                             /*!< PLL input clock * 24 */
#define CRM_CFG_PLLMULT_MULT25              0x20200000U                             /*!< PLL input clock * 25 */
#define CRM_CFG_PLLMULT_MULT26              0x20240000U                             /*!< PLL input clock * 26 */
#define CRM_CFG_PLLMULT_MULT27              0x20280000U                             /*!< PLL input clock * 27 */
#define CRM_CFG_PLLMULT_MULT28              0x202C0000U                             /*!< PLL input clock * 28 */
#define CRM_CFG_PLLMULT_MULT29              0x20300000U                             /*!< PLL input clock * 29 */
#define CRM_CFG_PLLMULT_MULT30              0x20340000U                             /*!< PLL input clock * 30 */
#define CRM_CFG_PLLMULT_MULT31              0x20380000U                             /*!< PLL input clock * 31 */
#define CRM_CFG_PLLMULT_MULT32              0x203C0000U                             /*!< PLL input clock * 32 */
#define CRM_CFG_PLLMULT_MULT33              0x40000000U                             /*!< PLL input clock * 33 */
#define CRM_CFG_PLLMULT_MULT34              0x40040000U                             /*!< PLL input clock * 34 */
#define CRM_CFG_PLLMULT_MULT35              0x40080000U                             /*!< PLL input clock * 35 */
#define CRM_CFG_PLLMULT_MULT36              0x400C0000U                             /*!< PLL input clock * 36 */
#define CRM_CFG_PLLMULT_MULT37              0x40100000U                             /*!< PLL input clock * 37 */
#define CRM_CFG_PLLMULT_MULT38              0x40140000U                             /*!< PLL input clock * 38 */
#define CRM_CFG_PLLMULT_MULT39              0x40180000U                             /*!< PLL input clock * 39 */
#define CRM_CFG_PLLMULT_MULT40              0x401C0000U                             /*!< PLL input clock * 40 */
#define CRM_CFG_PLLMULT_MULT41              0x40200000U                             /*!< PLL input clock * 41 */
#define CRM_CFG_PLLMULT_MULT42              0x40240000U                             /*!< PLL input clock * 42 */
#define CRM_CFG_PLLMULT_MULT43              0x40280000U                             /*!< PLL input clock * 43 */
#define CRM_CFG_PLLMULT_MULT44              0x402C0000U                             /*!< PLL input clock * 44 */
#define CRM_CFG_PLLMULT_MULT45              0x40300000U                             /*!< PLL input clock * 45 */
#define CRM_CFG_PLLMULT_MULT46              0x40340000U                             /*!< PLL input clock * 46 */
#define CRM_CFG_PLLMULT_MULT47              0x40380000U                             /*!< PLL input clock * 47 */
#define CRM_CFG_PLLMULT_MULT48              0x403C0000U                             /*!< PLL input clock * 48 */
#define CRM_CFG_PLLMULT_MULT49              0x60000000U                             /*!< PLL input clock * 49 */
#define CRM_CFG_PLLMULT_MULT50              0x60040000U                             /*!< PLL input clock * 50 */
#define CRM_CFG_PLLMULT_MULT51              0x60080000U                             /*!< PLL input clock * 51 */
#define CRM_CFG_PLLMULT_MULT52              0x600C0000U                             /*!< PLL input clock * 52 */
#define CRM_CFG_PLLMULT_MULT53              0x60100000U                             /*!< PLL input clock * 53 */
#define CRM_CFG_PLLMULT_MULT54              0x60140000U                             /*!< PLL input clock * 54 */
#define CRM_CFG_PLLMULT_MULT55              0x60180000U                             /*!< PLL input clock * 55 */
#define CRM_CFG_PLLMULT_MULT56              0x601C0000U                             /*!< PLL input clock * 56 */
#define CRM_CFG_PLLMULT_MULT57              0x60200000U                             /*!< PLL input clock * 57 */
#define CRM_CFG_PLLMULT_MULT58              0x60240000U                             /*!< PLL input clock * 58 */
#define CRM_CFG_PLLMULT_MULT59              0x60280000U                             /*!< PLL input clock * 59 */
#define CRM_CFG_PLLMULT_MULT60              0x602C0000U                             /*!< PLL input clock * 60 */
#define CRM_CFG_PLLMULT_MULT61              0x60300000U                             /*!< PLL input clock * 61 */
#define CRM_CFG_PLLMULT_MULT62              0x60340000U                             /*!< PLL input clock * 62 */
#define CRM_CFG_PLLMULT_MULT63              0x60380000U                             /*!< PLL input clock * 63 */
#define CRM_CFG_PLLMULT_MULT64              0x603C0000U                             /*!< PLL input clock * 64 */

