ChibiOS/ChibiOS-Contrib/os/common/ext/CMSIS/ArteryTek/AT32F415/at32f415cx.h
/*!< SSB configuration */
#define FLASH_USD_WDT_ATO_EN_Pos            (2U)
#define FLASH_USD_WDT_ATO_EN_Msk            (0x1U << FLASH_USD_WDT_ATO_EN_Pos)      /*!< 0x00000004 */
#define FLASH_USD_WDT_ATO_EN                FLASH_USD_WDT_ATO_EN_Msk                /*!< nWDT_ATO_EN */
#define FLASH_USD_DEPSLP_RST_Pos            (3U)
#define FLASH_USD_DEPSLP_RST_Msk            (0x1U << FLASH_USD_DEPSLP_RST_Pos)      /*!< 0x00000008 */
#define FLASH_USD_DEPSLP_RST                FLASH_USD_DEPSLP_RST_Msk                /*!< nDEPSLP_RST */
#define FLASH_USD_STDBY_RST_Pos             (4U)
#define FLASH_USD_STDBY_RST_Msk             (0x1U << FLASH_USD_STDBY_RST_Pos)       /*!< 0x00000010 */
#define FLASH_USD_STDBY_RST                 FLASH_USD_STDBY_RST_Msk                 /*!< nSTDBY_RST */
#define FLASH_USD_SSB_Pos                   (2U)
#define FLASH_USD_SSB_Msk                   (0x7U << FLASH_USD_SSB_Pos)             /*!< 0x0000001C */
#define FLASH_USD_SSB                       FLASH_USD_SSB_Msk                       /*!< System setting byte */

#define FLASH_USD_USER_D0_Pos               (10U)
#define FLASH_USD_USER_D0_Msk               (0xFFU << FLASH_USD_USER_D0_Pos)        /*!< 0x0003FC00 */
#define FLASH_USD_USER_D0                   FLASH_USD_USER_D0_Msk                   /*!< User data 0 */
#define FLASH_USD_USER_D1_Pos               (18U)
#define FLASH_USD_USER_D1_Msk               (0xFFU << FLASH_USD_USER_D1_Pos)        /*!< 0x03FC0000 */
#define FLASH_USD_USER_D1                   FLASH_USD_USER_D1_Msk                   /*!< User data 1 */
#define FLASH_USD_FAP_HL_Pos                (26U)
#define FLASH_USD_FAP_HL_Msk                (0x1U << FLASH_USD_FAP_HL_Pos)          /*!< 0x04000000 */
#define FLASH_USD_FAP_HL                    FLASH_USD_FAP_HL_Msk                    /*!< Flash access protection high level */

/******************  Bit definition for FLASH_EPPS register  ******************/
#define FLASH_EPPS_EPPS_Pos                 (0U)
#define FLASH_EPPS_EPPS_Msk                 (0xFFFFFFFFU << FLASH_EPPS_EPPS_Pos)    /*!< 0xFFFFFFFF */
#define FLASH_EPPS_EPPS                     FLASH_EPPS_EPPS_Msk                     /*!< Erase/Program protection status */

/******************  Bit definition for SLIB_STS0 register  *******************/
#define SLIB_STS0_BTM_AP_ENF_Pos            (0U)
#define SLIB_STS0_BTM_AP_ENF_Msk            (0x1U << SLIB_STS0_BTM_AP_ENF_Pos)      /*!< 0x00000001 */
#define SLIB_STS0_BTM_AP_ENF                SLIB_STS0_BTM_AP_ENF_Msk                /*!< Boot memory store application code enabled flag */
#define SLIB_STS0_EM_SLIB_ENF_Pos           (2U)
#define SLIB_STS0_EM_SLIB_ENF_Msk           (0x1U << SLIB_STS0_EM_SLIB_ENF_Pos)     /*!< 0x00000004 */
#define SLIB_STS0_EM_SLIB_ENF               SLIB_STS0_EM_SLIB_ENF_Msk               /*!< Extension memory sLib enable flag */
#define SLIB_STS0_SLIB_ENF_Pos              (3U)
#define SLIB_STS0_SLIB_ENF_Msk              (0x1U << SLIB_STS0_SLIB_ENF_Pos)        /*!< 0x00000008 */
#define SLIB_STS0_SLIB_ENF                  SLIB_STS0_SLIB_ENF_Msk                  /*!< Security library enable flag */
#define SLIB_STS0_EM_SLIB_DAT_SS_Pos        (16U)
#define SLIB_STS0_EM_SLIB_DAT_SS_Msk        (0xFFU << SLIB_STS0_EM_SLIB_DAT_SS_Pos) /*!< 0x00FF0000 */
#define SLIB_STS0_EM_SLIB_DAT_SS            SLIB_STS0_EM_SLIB_DAT_SS_Msk            /*!< Extension memory sLib data start sector */

/******************  Bit definition for SLIB_STS1 register  *******************/
#define SLIB_STS1_SLIB_SS_Pos               (0U)
#define SLIB_STS1_SLIB_SS_Msk               (0x7FFU << SLIB_STS1_SLIB_SS_Pos)       /*!< 0x000007FF */
#define SLIB_STS1_SLIB_SS                   SLIB_STS1_SLIB_SS_Msk                   /*!< Security library start sector */
#define SLIB_STS1_SLIB_DAT_SS_Pos           (11U)
#define SLIB_STS1_SLIB_DAT_SS_Msk           (0x7FFU << SLIB_STS1_SLIB_DAT_SS_Pos)   /*!< 0x003FF800 */
#define SLIB_STS1_SLIB_DAT_SS               SLIB_STS1_SLIB_DAT_SS_Msk               /*!< Security library data start sector */
#define SLIB_STS1_SLIB_ES_Pos               (22U)
#define SLIB_STS1_SLIB_ES_Msk               (0x3FFU << SLIB_STS1_SLIB_ES_Pos)       /*!< 0xFFC00000 */
#define SLIB_STS1_SLIB_ES                   SLIB_STS1_SLIB_ES_Msk                   /*!< Security library end sector */

/*****************  Bit definition for SLIB_PWD_CLR register  *****************/
#define SLIB_PWD_CLR_SLIB_PCLR_VAL_Pos      (0U)                                    /*!< 0xFFFFFFFF */
#define SLIB_PWD_CLR_SLIB_PCLR_VAL_Msk      (0xFFFFFFFFU << SLIB_PWD_CLR_SLIB_PCLR_VAL_Pos)
#define SLIB_PWD_CLR_SLIB_PCLR_VAL          SLIB_PWD_CLR_SLIB_PCLR_VAL_Msk          /*!< Security library password clear value */

/****************  Bit definition for SLIB_MISC_STS register  *****************/
#define SLIB_MISC_STS_SLIB_PWD_ERR_Pos      (0U)                                    /*!< 0x00000001 */
#define SLIB_MISC_STS_SLIB_PWD_ERR_Msk      (0x1U << SLIB_MISC_STS_SLIB_PWD_ERR_Pos)
#define SLIB_MISC_STS_SLIB_PWD_ERR          SLIB_MISC_STS_SLIB_PWD_ERR_Msk          /*!< Security library password error */
#define SLIB_MISC_STS_SLIB_PWD_OK_Pos       (1U)
#define SLIB_MISC_STS_SLIB_PWD_OK_Msk       (0x1U << SLIB_MISC_STS_SLIB_PWD_OK_Pos) /*!< 0x00000002 */
#define SLIB_MISC_STS_SLIB_PWD_OK           SLIB_MISC_STS_SLIB_PWD_OK_Msk           /*!< Security library password ok */
#define SLIB_MISC_STS_SLIB_ULKF_Pos         (2U)
#define SLIB_MISC_STS_SLIB_ULKF_Msk         (0x1U << SLIB_MISC_STS_SLIB_ULKF_Pos)   /*!< 0x00000004 */
#define SLIB_MISC_STS_SLIB_ULKF             SLIB_MISC_STS_SLIB_ULKF_Msk             /*!< Security library unlock flag */

/****************  Bit definition for FLASH_CRC_ADDR register  ****************/
#define FLASH_CRC_ADDR_CRC_ADDR_Pos         (0U)                                    /*!< 0xFFFFFFFF */
#define FLASH_CRC_ADDR_CRC_ADDR_Msk         (0xFFFFFFFFU << FLASH_CRC_ADDR_CRC_ADDR_Pos)
#define FLASH_CRC_ADDR_CRC_ADDR             FLASH_CRC_ADDR_CRC_ADDR_Msk             /*!< CRC address */

