ChibiOS/ChibiOS-Contrib/os/common/ext/CMSIS/ArteryTek/AT32F415/at32f415cx.h
#define IOMUX_REMAP2_CMP_MUX_MUX0           0x00000000U                             /*!< CMP1_OUT is connected to PA0, CMP2_OUT is connected to PA2 */
#define IOMUX_REMAP2_CMP_MUX_MUX1_Pos       (26U)
#define IOMUX_REMAP2_CMP_MUX_MUX1_Msk       (0x1U << IOMUX_REMAP2_CMP_MUX_MUX1_Pos) /*!< 0x04000000 */
#define IOMUX_REMAP2_CMP_MUX_MUX1           IOMUX_REMAP2_CMP_MUX_MUX1_Msk           /*!< CMP1_OUT is connected to PA6, CMP2_OUT is connected to PA7 */
#define IOMUX_REMAP2_CMP_MUX_MUX2_Pos       (27U)
#define IOMUX_REMAP2_CMP_MUX_MUX2_Msk       (0x1U << IOMUX_REMAP2_CMP_MUX_MUX2_Pos) /*!< 0x08000000 */
#define IOMUX_REMAP2_CMP_MUX_MUX2           IOMUX_REMAP2_CMP_MUX_MUX2_Msk           /*!< CMP1_OUT is connected to PA11, CMP2_OUT is connected to PA12 */

/*****************  Bit definition for IOMUX_REMAP3 register  *****************/
/*!< TMR9_GMUX configuration */
#define IOMUX_REMAP3_TMR9_GMUX_Pos          (0U)
#define IOMUX_REMAP3_TMR9_GMUX_Msk          (0xFU << IOMUX_REMAP3_TMR9_GMUX_Pos)    /*!< 0x0000000F */
#define IOMUX_REMAP3_TMR9_GMUX              IOMUX_REMAP3_TMR9_GMUX_Msk              /*!< TMR9_GMUX[3:0] bits (TMR9 IO general multiplexing) */
#define IOMUX_REMAP3_TMR9_GMUX_0            (0x1U << IOMUX_REMAP3_TMR9_GMUX_Pos)    /*!< 0x00000001 */
#define IOMUX_REMAP3_TMR9_GMUX_1            (0x2U << IOMUX_REMAP3_TMR9_GMUX_Pos)    /*!< 0x00000002 */
#define IOMUX_REMAP3_TMR9_GMUX_2            (0x4U << IOMUX_REMAP3_TMR9_GMUX_Pos)    /*!< 0x00000004 */
#define IOMUX_REMAP3_TMR9_GMUX_3            (0x8U << IOMUX_REMAP3_TMR9_GMUX_Pos)    /*!< 0x00000008 */

#define IOMUX_REMAP3_TMR9_GMUX_MUX0         0x00000000U                             /*!< CH1/PA2, CH2/PA3 */
#define IOMUX_REMAP3_TMR9_GMUX_MUX2_Pos     (1U)                                    /*!< 0x00000002 */
#define IOMUX_REMAP3_TMR9_GMUX_MUX2_Msk     (0x1U << IOMUX_REMAP3_TMR9_GMUX_MUX2_Pos)
#define IOMUX_REMAP3_TMR9_GMUX_MUX2         IOMUX_REMAP3_TMR9_GMUX_MUX2_Msk         /*!< CH1/PB14, CH2/PB15 */

/*!< TMR10_GMUX configuration */
#define IOMUX_REMAP3_TMR10_GMUX_Pos         (4U)
#define IOMUX_REMAP3_TMR10_GMUX_Msk         (0xFU << IOMUX_REMAP3_TMR10_GMUX_Pos)   /*!< 0x000000F0 */
#define IOMUX_REMAP3_TMR10_GMUX             IOMUX_REMAP3_TMR10_GMUX_Msk             /*!< TMR10_GMUX[3:0] bits (TMR10 IO general multiplexing) */
#define IOMUX_REMAP3_TMR10_GMUX_0           (0x1U << IOMUX_REMAP3_TMR10_GMUX_Pos)   /*!< 0x00000010 */
#define IOMUX_REMAP3_TMR10_GMUX_1           (0x2U << IOMUX_REMAP3_TMR10_GMUX_Pos)   /*!< 0x00000020 */
#define IOMUX_REMAP3_TMR10_GMUX_2           (0x4U << IOMUX_REMAP3_TMR10_GMUX_Pos)   /*!< 0x00000040 */
#define IOMUX_REMAP3_TMR10_GMUX_3           (0x8U << IOMUX_REMAP3_TMR10_GMUX_Pos)   /*!< 0x00000080 */

#define IOMUX_REMAP3_TMR10_GMUX_MUX0        0x00000000U                             /*!< CH1/PB8 */
#define IOMUX_REMAP3_TMR10_GMUX_MUX2_Pos    (5U)                                    /*!< 0x00000020 */
#define IOMUX_REMAP3_TMR10_GMUX_MUX2_Msk    (0x1U << IOMUX_REMAP3_TMR10_GMUX_MUX2_Pos)
#define IOMUX_REMAP3_TMR10_GMUX_MUX2        IOMUX_REMAP3_TMR10_GMUX_MUX2_Msk        /*!< CH1/PA6 */

/*!< TMR11_GMUX configuration */
#define IOMUX_REMAP3_TMR11_GMUX_Pos         (8U)
#define IOMUX_REMAP3_TMR11_GMUX_Msk         (0xFU << IOMUX_REMAP3_TMR11_GMUX_Pos)   /*!< 0x00000F00 */
#define IOMUX_REMAP3_TMR11_GMUX             IOMUX_REMAP3_TMR11_GMUX_Msk             /*!< TMR11_GMUX[3:0] bits (TMR11 IO general multiplexing) */
#define IOMUX_REMAP3_TMR11_GMUX_0           (0x1U << IOMUX_REMAP3_TMR11_GMUX_Pos)   /*!< 0x00000100 */
#define IOMUX_REMAP3_TMR11_GMUX_1           (0x2U << IOMUX_REMAP3_TMR11_GMUX_Pos)   /*!< 0x00000200 */
#define IOMUX_REMAP3_TMR11_GMUX_2           (0x4U << IOMUX_REMAP3_TMR11_GMUX_Pos)   /*!< 0x00000400 */
#define IOMUX_REMAP3_TMR11_GMUX_3           (0x8U << IOMUX_REMAP3_TMR11_GMUX_Pos)   /*!< 0x00000800 */

#define IOMUX_REMAP3_TMR11_GMUX_MUX0        0x00000000U                             /*!< CH1/PB9 */
#define IOMUX_REMAP3_TMR11_GMUX_MUX2_Pos    (9U)                                    /*!< 0x00000200 */
#define IOMUX_REMAP3_TMR11_GMUX_MUX2_Msk    (0x1U << IOMUX_REMAP3_TMR11_GMUX_MUX2_Pos)
#define IOMUX_REMAP3_TMR11_GMUX_MUX2        IOMUX_REMAP3_TMR11_GMUX_MUX2_Msk        /*!< CH1/PA7 */

/*****************  Bit definition for IOMUX_REMAP4 register  *****************/
/*!< TMR1_GMUX configuration */
#define IOMUX_REMAP4_TMR1_GMUX_Pos          (0U)
#define IOMUX_REMAP4_TMR1_GMUX_Msk          (0xFU << IOMUX_REMAP4_TMR1_GMUX_Pos)    /*!< 0x0000000F */
#define IOMUX_REMAP4_TMR1_GMUX              IOMUX_REMAP4_TMR1_GMUX_Msk              /*!< TMR1_GMUX[3:0] bits (TMR1 IO general multiplexing) */
#define IOMUX_REMAP4_TMR1_GMUX_0            (0x1U << IOMUX_REMAP4_TMR1_GMUX_Pos)    /*!< 0x00000001 */
#define IOMUX_REMAP4_TMR1_GMUX_1            (0x2U << IOMUX_REMAP4_TMR1_GMUX_Pos)    /*!< 0x00000002 */
#define IOMUX_REMAP4_TMR1_GMUX_2            (0x4U << IOMUX_REMAP4_TMR1_GMUX_Pos)    /*!< 0x00000004 */
#define IOMUX_REMAP4_TMR1_GMUX_3            (0x8U << IOMUX_REMAP4_TMR1_GMUX_Pos)    /*!< 0x00000008 */

#define IOMUX_REMAP4_TMR1_GMUX_MUX0         0x00000000U                             /*!< EXT/PA12, CH1/PA8, CH2/PA9, CH3/PA10, CH4/PA11, BRK/PB12, CH1C/PB13, CH2C/PB14, CH3C/PB15 */
#define IOMUX_REMAP4_TMR1_GMUX_MUX1_Pos     (0U)                                    /*!< 0x00000001 */
#define IOMUX_REMAP4_TMR1_GMUX_MUX1_Msk     (0x1U << IOMUX_REMAP4_TMR1_GMUX_MUX1_Pos)
#define IOMUX_REMAP4_TMR1_GMUX_MUX1         IOMUX_REMAP4_TMR1_GMUX_MUX1_Msk         /*!< EXT/PA12, CH1/PA8, CH2/PA9, CH3/PA10, CH4/PA11, BRK/PA6, CH1C/PA7, CH2C/PB0, CH3C/PB1 */
#define IOMUX_REMAP4_TMR1_GMUX_MUX2_Pos     (1U)                                    /*!< 0x00000002 */
#define IOMUX_REMAP4_TMR1_GMUX_MUX2_Msk     (0x1U << IOMUX_REMAP4_TMR1_GMUX_MUX2_Pos)
#define IOMUX_REMAP4_TMR1_GMUX_MUX2         IOMUX_REMAP4_TMR1_GMUX_MUX2_Msk         /*!< EXT/PA0, CH1/PC6, CH2/PC7, CH3/PC8, CH4/PC9, BRK/PA6, CH1C/PA7, CH2C/PB0, CH3C/PB1 */

/*!< TMR2_GMUX configuration */
#define IOMUX_REMAP4_TMR2_GMUX_Pos          (4U)
#define IOMUX_REMAP4_TMR2_GMUX_Msk          (0x7U << IOMUX_REMAP4_TMR2_GMUX_Pos)    /*!< 0x00000070 */
#define IOMUX_REMAP4_TMR2_GMUX              IOMUX_REMAP4_TMR2_GMUX_Msk              /*!< TMR2_GMUX[2:0] bits (TMR2 IO general multiplexing) */
#define IOMUX_REMAP4_TMR2_GMUX_0            (0x1U << IOMUX_REMAP4_TMR2_GMUX_Pos)    /*!< 0x00000010 */
#define IOMUX_REMAP4_TMR2_GMUX_1            (0x2U << IOMUX_REMAP4_TMR2_GMUX_Pos)    /*!< 0x00000020 */
#define IOMUX_REMAP4_TMR2_GMUX_2            (0x4U << IOMUX_REMAP4_TMR2_GMUX_Pos)    /*!< 0x00000040 */

#define IOMUX_REMAP4_TMR2_GMUX_MUX0         0x00000000U                             /*!< CH1_EXT/PA0, CH2/PA1, CH3/PA2, CH4/PA3 */
#define IOMUX_REMAP4_TMR2_GMUX_MUX1_Pos     (4U)                                    /*!< 0x00000010 */
#define IOMUX_REMAP4_TMR2_GMUX_MUX1_Msk     (0x1U << IOMUX_REMAP4_TMR2_GMUX_MUX1_Pos)
#define IOMUX_REMAP4_TMR2_GMUX_MUX1         IOMUX_REMAP4_TMR2_GMUX_MUX1_Msk         /*!< CH1_EXT/PA15, CH2/PB3, CH3/PA2, CH4/PA3 */
#define IOMUX_REMAP4_TMR2_GMUX_MUX2_Pos     (5U)                                    /*!< 0x00000020 */
#define IOMUX_REMAP4_TMR2_GMUX_MUX2_Msk     (0x1U << IOMUX_REMAP4_TMR2_GMUX_MUX2_Pos)
#define IOMUX_REMAP4_TMR2_GMUX_MUX2         IOMUX_REMAP4_TMR2_GMUX_MUX2_Msk         /*!< CH1_EXT/PA0, CH2/PA1, CH3/PB10, CH4/PB11 */
#define IOMUX_REMAP4_TMR2_GMUX_MUX3_Pos     (4U)                                    /*!< 0x00000030 */
#define IOMUX_REMAP4_TMR2_GMUX_MUX3_Msk     (0x3U << IOMUX_REMAP4_TMR2_GMUX_MUX3_Pos)
#define IOMUX_REMAP4_TMR2_GMUX_MUX3         IOMUX_REMAP4_TMR2_GMUX_MUX3_Msk         /*!< CH1_EXT/PA15, CH2/PB3, CH3/PB10, CH4/PB11 */

/*!< TMR3_GMUX configuration */
#define IOMUX_REMAP4_TMR3_GMUX_Pos          (8U)
#define IOMUX_REMAP4_TMR3_GMUX_Msk          (0xFU << IOMUX_REMAP4_TMR3_GMUX_Pos)    /*!< 0x00000F00 */
#define IOMUX_REMAP4_TMR3_GMUX              IOMUX_REMAP4_TMR3_GMUX_Msk              /*!< TMR3_GMUX[3:0] bits (TMR3 IO general multiplexing) */
#define IOMUX_REMAP4_TMR3_GMUX_0            (0x1U << IOMUX_REMAP4_TMR3_GMUX_Pos)    /*!< 0x00000100 */
#define IOMUX_REMAP4_TMR3_GMUX_1            (0x2U << IOMUX_REMAP4_TMR3_GMUX_Pos)    /*!< 0x00000200 */
#define IOMUX_REMAP4_TMR3_GMUX_2            (0x4U << IOMUX_REMAP4_TMR3_GMUX_Pos)    /*!< 0x00000400 */
#define IOMUX_REMAP4_TMR3_GMUX_3            (0x8U << IOMUX_REMAP4_TMR3_GMUX_Pos)    /*!< 0x00000800 */

#define IOMUX_REMAP4_TMR3_GMUX_MUX0         0x00000000U                             /*!< CH1/PA6, CH2/PA7, CH3/PB0, CH4/PB1 */
#define IOMUX_REMAP4_TMR3_GMUX_MUX2_Pos     (9U)                                    /*!< 0x00000200 */
#define IOMUX_REMAP4_TMR3_GMUX_MUX2_Msk     (0x1U << IOMUX_REMAP4_TMR3_GMUX_MUX2_Pos)
#define IOMUX_REMAP4_TMR3_GMUX_MUX2         IOMUX_REMAP4_TMR3_GMUX_MUX2_Msk         /*!< CH1/PB4, CH2/PB5, CH3/PB0, CH4/PB1 */
#define IOMUX_REMAP4_TMR3_GMUX_MUX3_Pos     (8U)                                    /*!< 0x00000300 */
#define IOMUX_REMAP4_TMR3_GMUX_MUX3_Msk     (0x3U << IOMUX_REMAP4_TMR3_GMUX_MUX3_Pos)
#define IOMUX_REMAP4_TMR3_GMUX_MUX3         IOMUX_REMAP4_TMR3_GMUX_MUX3_Msk         /*!< CH1/PC6, CH2/PC7, CH3/PC8, CH4/PC9 */

