ChibiOS/ChibiOS-Contrib/os/common/ext/CMSIS/ArteryTek/AT32F415/at32f415cx.h
/*****************  Bit definition for IOMUX_REMAP8 register  *****************/
/*!< TMR1_BK1_CMP_GMUX configuration */
#define IOMUX_REMAP8_TMR1_BK1_CMP_GMUX_Pos  (0U)                                    /*!< 0x00000003 */
#define IOMUX_REMAP8_TMR1_BK1_CMP_GMUX_Msk  (0x3U << IOMUX_REMAP8_TMR1_BK1_CMP_GMUX_Pos)
#define IOMUX_REMAP8_TMR1_BK1_CMP_GMUX      IOMUX_REMAP8_TMR1_BK1_CMP_GMUX_Msk      /*!< TMR1_BK1_CMP_GMUX[1:0] bits (TMR1 break channel 1 internal mapping) */
#define IOMUX_REMAP8_TMR1_BK1_CMP_GMUX_0    (0x1U << IOMUX_REMAP8_TMR1_BK1_CMP_GMUX_Pos)  /*!< 0x00000001 */
#define IOMUX_REMAP8_TMR1_BK1_CMP_GMUX_1    (0x2U << IOMUX_REMAP8_TMR1_BK1_CMP_GMUX_Pos)  /*!< 0x00000002 */

#define IOMUX_REMAP8_TMR1_BK1_CMP_GMUX_MUX0     0x00000000U                             /*!< TMR1_GMUX IO signal is connected to TMR1 BRK channel 1 */
#define IOMUX_REMAP8_TMR1_BK1_CMP_GMUX_MUX2_Pos (1U)                                    /*!< 0x00000002 */
#define IOMUX_REMAP8_TMR1_BK1_CMP_GMUX_MUX2_Msk (0x1U << IOMUX_REMAP8_TMR1_BK1_CMP_GMUX_MUX2_Pos)
#define IOMUX_REMAP8_TMR1_BK1_CMP_GMUX_MUX2     IOMUX_REMAP8_TMR1_BK1_CMP_GMUX_MUX2_Msk /*!< CMP output signal is connected to TMR1 BRK channel 1 */
#define IOMUX_REMAP8_TMR1_BK1_CMP_GMUX_MUX3_Pos (0U)                                    /*!< 0x00000003 */
#define IOMUX_REMAP8_TMR1_BK1_CMP_GMUX_MUX3_Msk (0x3U << IOMUX_REMAP8_TMR1_BK1_CMP_GMUX_MUX3_Pos)
#define IOMUX_REMAP8_TMR1_BK1_CMP_GMUX_MUX3     IOMUX_REMAP8_TMR1_BK1_CMP_GMUX_MUX3_Msk /*!< Either CMP output signal or TMR1_GMUX IO signal is connected to TMR1 BRK channel 1 */

/*!< TMR1_CH1_CMP_GMUX configuration */
#define IOMUX_REMAP8_TMR1_CH1_CMP_GMUX_Pos  (2U)                                    /*!< 0x0000000C */
#define IOMUX_REMAP8_TMR1_CH1_CMP_GMUX_Msk  (0x3U << IOMUX_REMAP8_TMR1_CH1_CMP_GMUX_Pos)
#define IOMUX_REMAP8_TMR1_CH1_CMP_GMUX      IOMUX_REMAP8_TMR1_CH1_CMP_GMUX_Msk      /*!< TMR1_CH1_CMP_GMUX[1:0] bits (TMR1 channel 1 internal mapping) */
#define IOMUX_REMAP8_TMR1_CH1_CMP_GMUX_0    (0x1U << IOMUX_REMAP8_TMR1_CH1_CMP_GMUX_Pos)  /*!< 0x00000004 */
#define IOMUX_REMAP8_TMR1_CH1_CMP_GMUX_1    (0x2U << IOMUX_REMAP8_TMR1_CH1_CMP_GMUX_Pos)  /*!< 0x00000008 */

#define IOMUX_REMAP8_TMR1_CH1_CMP_GMUX_MUX0     0x00000000U                             /*!< TMR1_GMUX IO signal is connected to TMR1 channel 1 */
#define IOMUX_REMAP8_TMR1_CH1_CMP_GMUX_MUX2_Pos (3U)                                    /*!< 0x00000008 */
#define IOMUX_REMAP8_TMR1_CH1_CMP_GMUX_MUX2_Msk (0x1U << IOMUX_REMAP8_TMR1_CH1_CMP_GMUX_MUX2_Pos)
#define IOMUX_REMAP8_TMR1_CH1_CMP_GMUX_MUX2     IOMUX_REMAP8_TMR1_CH1_CMP_GMUX_MUX2_Msk /*!< CMP output signal is connected to TMR1 channel 1 */
#define IOMUX_REMAP8_TMR1_CH1_CMP_GMUX_MUX3_Pos (2U)                                    /*!< 0x0000000C */
#define IOMUX_REMAP8_TMR1_CH1_CMP_GMUX_MUX3_Msk (0x3U << IOMUX_REMAP8_TMR1_CH1_CMP_GMUX_MUX3_Pos)
#define IOMUX_REMAP8_TMR1_CH1_CMP_GMUX_MUX3     IOMUX_REMAP8_TMR1_CH1_CMP_GMUX_MUX3_Msk /*!< Either CMP output signal or TMR1_GMUX IO signal is connected to TMR1 channel 1 */

/*!< TMR2_CH4_CMP_GMUX configuration */
#define IOMUX_REMAP8_TMR2_CH4_CMP_GMUX_Pos  (4U)                                    /*!< 0x00000030 */
#define IOMUX_REMAP8_TMR2_CH4_CMP_GMUX_Msk  (0x3U << IOMUX_REMAP8_TMR2_CH4_CMP_GMUX_Pos)
#define IOMUX_REMAP8_TMR2_CH4_CMP_GMUX      IOMUX_REMAP8_TMR2_CH4_CMP_GMUX_Msk      /*!< TMR2_CH4_CMP_GMUX[1:0] bits (TMR2 channel 4 internal mapping) */
#define IOMUX_REMAP8_TMR2_CH4_CMP_GMUX_0    (0x1U << IOMUX_REMAP8_TMR2_CH4_CMP_GMUX_Pos)  /*!< 0x00000010 */
#define IOMUX_REMAP8_TMR2_CH4_CMP_GMUX_1    (0x2U << IOMUX_REMAP8_TMR2_CH4_CMP_GMUX_Pos)  /*!< 0x00000020 */

#define IOMUX_REMAP8_TMR2_CH4_CMP_GMUX_MUX0     0x00000000U                             /*!< TMR2_GMUX IO signal is connected to TMR2 channel 4 */
#define IOMUX_REMAP8_TMR2_CH4_CMP_GMUX_MUX2_Pos (5U)                                    /*!< 0x00000020 */
#define IOMUX_REMAP8_TMR2_CH4_CMP_GMUX_MUX2_Msk (0x1U << IOMUX_REMAP8_TMR2_CH4_CMP_GMUX_MUX2_Pos)
#define IOMUX_REMAP8_TMR2_CH4_CMP_GMUX_MUX2     IOMUX_REMAP8_TMR2_CH4_CMP_GMUX_MUX2_Msk /*!< CMP output signal is connected to TMR2 channel 4 */
#define IOMUX_REMAP8_TMR2_CH4_CMP_GMUX_MUX3_Pos (4U)                                    /*!< 0x00000030 */
#define IOMUX_REMAP8_TMR2_CH4_CMP_GMUX_MUX3_Msk (0x3U << IOMUX_REMAP8_TMR2_CH4_CMP_GMUX_MUX3_Pos)
#define IOMUX_REMAP8_TMR2_CH4_CMP_GMUX_MUX3     IOMUX_REMAP8_TMR2_CH4_CMP_GMUX_MUX3_Msk /*!< Either CMP output signal or TMR2_GMUX IO signal is connected to TMR2 channel 4 */

/*!< TMR3_CH1_CMP_GMUX configuration */
#define IOMUX_REMAP8_TMR3_CH1_CMP_GMUX_Pos  (6U)                                    /*!< 0x000000C0 */
#define IOMUX_REMAP8_TMR3_CH1_CMP_GMUX_Msk  (0x3U << IOMUX_REMAP8_TMR3_CH1_CMP_GMUX_Pos)
#define IOMUX_REMAP8_TMR3_CH1_CMP_GMUX      IOMUX_REMAP8_TMR3_CH1_CMP_GMUX_Msk      /*!< TMR3_CH1_CMP_GMUX[1:0] bits (TMR3 channel 1 internal mapping) */
#define IOMUX_REMAP8_TMR3_CH1_CMP_GMUX_0    (0x1U << IOMUX_REMAP8_TMR3_CH1_CMP_GMUX_Pos)  /*!< 0x00000040 */
#define IOMUX_REMAP8_TMR3_CH1_CMP_GMUX_1    (0x2U << IOMUX_REMAP8_TMR3_CH1_CMP_GMUX_Pos)  /*!< 0x00000080 */

#define IOMUX_REMAP8_TMR3_CH1_CMP_GMUX_MUX0     0x00000000U                             /*!< TMR3_GMUX IO signal is connected to TMR3 channel 1 */
#define IOMUX_REMAP8_TMR3_CH1_CMP_GMUX_MUX2_Pos (7U)                                    /*!< 0x00000080 */
#define IOMUX_REMAP8_TMR3_CH1_CMP_GMUX_MUX2_Msk (0x1U << IOMUX_REMAP8_TMR3_CH1_CMP_GMUX_MUX2_Pos)
#define IOMUX_REMAP8_TMR3_CH1_CMP_GMUX_MUX2     IOMUX_REMAP8_TMR3_CH1_CMP_GMUX_MUX2_Msk /*!< CMP output signal is connected to TMR3 channel 1 */
#define IOMUX_REMAP8_TMR3_CH1_CMP_GMUX_MUX3_Pos (6U)                                    /*!< 0x000000C0 */
#define IOMUX_REMAP8_TMR3_CH1_CMP_GMUX_MUX3_Msk (0x3U << IOMUX_REMAP8_TMR3_CH1_CMP_GMUX_MUX3_Pos)
#define IOMUX_REMAP8_TMR3_CH1_CMP_GMUX_MUX3     IOMUX_REMAP8_TMR3_CH1_CMP_GMUX_MUX3_Msk /*!< Either CMP output signal or TMR3_GMUX IO signal is connected to TMR3 channel 1 */

/******************************************************************************/
/*                                                                            */
/*                External interrupt/Event controller (EXINT)                 */
/*                                                                            */
/******************************************************************************/

