ChibiOS/ChibiOS-Contrib/os/common/ext/CMSIS/ArteryTek/AT32F415/at32f415cx.h
/*******************  Bit definition for CRC_IDT register  ********************/
#define CRC_IDT_IDT_Pos                     (0U)
#define CRC_IDT_IDT_Msk                     (0xFFFFFFFFU << CRC_IDT_IDT_Pos)        /*!< 0xFFFFFFFF */
#define CRC_IDT_IDT                         CRC_IDT_IDT_Msk                         /*!< Initialization data register */

/*******************  Bit definition for CRC_POLY register  *******************/
#define CRC_POLY_POLY_Pos                   (0U)
#define CRC_POLY_POLY_Msk                   (0xFFFFFFFFU << CRC_POLY_POLY_Pos)      /*!< 0xFFFFFFFF */
#define CRC_POLY_POLY                       CRC_POLY_POLY_Msk                       /*!< Polynomial coefficient */

/******************************************************************************/
/*                                                                            */
/*                  Inter-integrated circuit interface (I2C)                  */
/*                                                                            */
/******************************************************************************/

/******************  Bit definition for I2C_CTRL1 register  *******************/
#define I2C_CTRL1_I2CEN_Pos                 (0U)
#define I2C_CTRL1_I2CEN_Msk                 (0x1U << I2C_CTRL1_I2CEN_Pos)           /*!< 0x00000001 */
#define I2C_CTRL1_I2CEN                     I2C_CTRL1_I2CEN_Msk                     /*!< I2C peripheral enable */
#define I2C_CTRL1_PERMODE_Pos               (1U)
#define I2C_CTRL1_PERMODE_Msk               (0x1U << I2C_CTRL1_PERMODE_Pos)         /*!< 0x00000002 */
#define I2C_CTRL1_PERMODE                   I2C_CTRL1_PERMODE_Msk                   /*!< I2C peripheral mode */
#define I2C_CTRL1_SMBMODE_Pos               (3U)
#define I2C_CTRL1_SMBMODE_Msk               (0x1U << I2C_CTRL1_SMBMODE_Pos)         /*!< 0x00000008 */
#define I2C_CTRL1_SMBMODE                   I2C_CTRL1_SMBMODE_Msk                   /*!< SMBus device mode */
#define I2C_CTRL1_ARPEN_Pos                 (4U)
#define I2C_CTRL1_ARPEN_Msk                 (0x1U << I2C_CTRL1_ARPEN_Pos)           /*!< 0x00000010 */
#define I2C_CTRL1_ARPEN                     I2C_CTRL1_ARPEN_Msk                     /*!< SMBus address resolution protocol enable */
#define I2C_CTRL1_PECEN_Pos                 (5U)
#define I2C_CTRL1_PECEN_Msk                 (0x1U << I2C_CTRL1_PECEN_Pos)           /*!< 0x00000020 */
#define I2C_CTRL1_PECEN                     I2C_CTRL1_PECEN_Msk                     /*!< PEC calculation enable */
#define I2C_CTRL1_GCAEN_Pos                 (6U)
#define I2C_CTRL1_GCAEN_Msk                 (0x1U << I2C_CTRL1_GCAEN_Pos)           /*!< 0x00000040 */
#define I2C_CTRL1_GCAEN                     I2C_CTRL1_GCAEN_Msk                     /*!< General call address enable */
#define I2C_CTRL1_STRETCH_Pos               (7U)
#define I2C_CTRL1_STRETCH_Msk               (0x1U << I2C_CTRL1_STRETCH_Pos)         /*!< 0x00000080 */
#define I2C_CTRL1_STRETCH                   I2C_CTRL1_STRETCH_Msk                   /*!< Clock stretching mode */
#define I2C_CTRL1_GENSTART_Pos              (8U)
#define I2C_CTRL1_GENSTART_Msk              (0x1U << I2C_CTRL1_GENSTART_Pos)        /*!< 0x00000100 */
#define I2C_CTRL1_GENSTART                  I2C_CTRL1_GENSTART_Msk                  /*!< Generate start condition */
#define I2C_CTRL1_GENSTOP_Pos               (9U)
#define I2C_CTRL1_GENSTOP_Msk               (0x1U << I2C_CTRL1_GENSTOP_Pos)         /*!< 0x00000200 */
#define I2C_CTRL1_GENSTOP                   I2C_CTRL1_GENSTOP_Msk                   /*!< Generate stop condition */
#define I2C_CTRL1_ACKEN_Pos                 (10U)
#define I2C_CTRL1_ACKEN_Msk                 (0x1U << I2C_CTRL1_ACKEN_Pos)           /*!< 0x00000400 */
#define I2C_CTRL1_ACKEN                     I2C_CTRL1_ACKEN_Msk                     /*!< Acknowledge enable */
#define I2C_CTRL1_MACKCTRL_Pos              (11U)
#define I2C_CTRL1_MACKCTRL_Msk              (0x1U << I2C_CTRL1_MACKCTRL_Pos)        /*!< 0x00000800 */
#define I2C_CTRL1_MACKCTRL                  I2C_CTRL1_MACKCTRL_Msk                  /*!< Master receive mode acknowledge control */
#define I2C_CTRL1_PECTEN_Pos                (12U)
#define I2C_CTRL1_PECTEN_Msk                (0x1U << I2C_CTRL1_PECTEN_Pos)          /*!< 0x00001000 */
#define I2C_CTRL1_PECTEN                    I2C_CTRL1_PECTEN_Msk                    /*!< Request PEC transfer enable */
#define I2C_CTRL1_SMBALERT_Pos              (13U)
#define I2C_CTRL1_SMBALERT_Msk              (0x1U << I2C_CTRL1_SMBALERT_Pos)        /*!< 0x00002000 */
#define I2C_CTRL1_SMBALERT                  I2C_CTRL1_SMBALERT_Msk                  /*!< SMBus alert pin set */
#define I2C_CTRL1_RESET_Pos                 (15U)
#define I2C_CTRL1_RESET_Msk                 (0x1U << I2C_CTRL1_RESET_Pos)           /*!< 0x00008000 */
#define I2C_CTRL1_RESET                     I2C_CTRL1_RESET_Msk                     /*!< I2C peripheral reset */

/******************  Bit definition for I2C_CTRL2 register  *******************/
/*!< CLKFREQ configuration */
#define I2C_CTRL2_CLKFREQ_Pos               (0U)
#define I2C_CTRL2_CLKFREQ_Msk               (0xFFU << I2C_CTRL2_CLKFREQ_Pos)        /*!< 0x000000FF */
#define I2C_CTRL2_CLKFREQ                   I2C_CTRL2_CLKFREQ_Msk                   /*!< CLKFREQ[7:0] bits (I2C input clock frequency) */
#define I2C_CTRL2_CLKFREQ_0                 (0x01U << I2C_CTRL2_CLKFREQ_Pos)        /*!< 0x00000001 */
#define I2C_CTRL2_CLKFREQ_1                 (0x02U << I2C_CTRL2_CLKFREQ_Pos)        /*!< 0x00000002 */
#define I2C_CTRL2_CLKFREQ_2                 (0x04U << I2C_CTRL2_CLKFREQ_Pos)        /*!< 0x00000004 */
#define I2C_CTRL2_CLKFREQ_3                 (0x08U << I2C_CTRL2_CLKFREQ_Pos)        /*!< 0x00000008 */
#define I2C_CTRL2_CLKFREQ_4                 (0x10U << I2C_CTRL2_CLKFREQ_Pos)        /*!< 0x00000010 */
#define I2C_CTRL2_CLKFREQ_5                 (0x20U << I2C_CTRL2_CLKFREQ_Pos)        /*!< 0x00000020 */
#define I2C_CTRL2_CLKFREQ_6                 (0x40U << I2C_CTRL2_CLKFREQ_Pos)        /*!< 0x00000040 */
#define I2C_CTRL2_CLKFREQ_7                 (0x80U << I2C_CTRL2_CLKFREQ_Pos)        /*!< 0x00000080 */

