ChibiOS/ChibiOS-Contrib/os/common/ext/CMSIS/ArteryTek/AT32F415/at32f415cx.h
/*******************  Bit definition for CAN_RFC1 register  *******************/
#define CAN_RFC1_RFDTL_Pos                  (0U)
#define CAN_RFC1_RFDTL_Msk                  (0xFU << CAN_RFC1_RFDTL_Pos)            /*!< 0x0000000F */
#define CAN_RFC1_RFDTL                      CAN_RFC1_RFDTL_Msk                      /*!< Receive FIFO data length */
#define CAN_RFC1_RFFMN_Pos                  (8U)
#define CAN_RFC1_RFFMN_Msk                  (0xFFU << CAN_RFC1_RFFMN_Pos)           /*!< 0x0000FF00 */
#define CAN_RFC1_RFFMN                      CAN_RFC1_RFFMN_Msk                      /*!< Receive FIFO filter match number */
#define CAN_RFC1_RFTS_Pos                   (16U)
#define CAN_RFC1_RFTS_Msk                   (0xFFFFU << CAN_RFC1_RFTS_Pos)          /*!< 0xFFFF0000 */
#define CAN_RFC1_RFTS                       CAN_RFC1_RFTS_Msk                       /*!< Receive FIFO time stamp */

/******************  Bit definition for CAN_RFDTL1 register  ******************/
#define CAN_RFDTL1_RFDT0_Pos                (0U)
#define CAN_RFDTL1_RFDT0_Msk                (0xFFU << CAN_RFDTL1_RFDT0_Pos)         /*!< 0x000000FF */
#define CAN_RFDTL1_RFDT0                    CAN_RFDTL1_RFDT0_Msk                    /*!< Receive FIFO data byte 0 */
#define CAN_RFDTL1_RFDT1_Pos                (8U)
#define CAN_RFDTL1_RFDT1_Msk                (0xFFU << CAN_RFDTL1_RFDT1_Pos)         /*!< 0x0000FF00 */
#define CAN_RFDTL1_RFDT1                    CAN_RFDTL1_RFDT1_Msk                    /*!< Receive FIFO data byte 1 */
#define CAN_RFDTL1_RFDT2_Pos                (16U)
#define CAN_RFDTL1_RFDT2_Msk                (0xFFU << CAN_RFDTL1_RFDT2_Pos)         /*!< 0x00FF0000 */
#define CAN_RFDTL1_RFDT2                    CAN_RFDTL1_RFDT2_Msk                    /*!< Receive FIFO data byte 2 */
#define CAN_RFDTL1_RFDT3_Pos                (24U)
#define CAN_RFDTL1_RFDT3_Msk                (0xFFU << CAN_RFDTL1_RFDT3_Pos)         /*!< 0xFF000000 */
#define CAN_RFDTL1_RFDT3                    CAN_RFDTL1_RFDT3_Msk                    /*!< Receive FIFO data byte 3 */

/******************  Bit definition for CAN_RFDTH1 register  ******************/
#define CAN_RFDTH1_RFDT4_Pos                (0U)
#define CAN_RFDTH1_RFDT4_Msk                (0xFFU << CAN_RFDTH1_RFDT4_Pos)         /*!< 0x000000FF */
#define CAN_RFDTH1_RFDT4                    CAN_RFDTH1_RFDT4_Msk                    /*!< Receive FIFO data byte 4 */
#define CAN_RFDTH1_RFDT5_Pos                (8U)
#define CAN_RFDTH1_RFDT5_Msk                (0xFFU << CAN_RFDTH1_RFDT5_Pos)         /*!< 0x0000FF00 */
#define CAN_RFDTH1_RFDT5                    CAN_RFDTH1_RFDT5_Msk                    /*!< Receive FIFO data byte 5 */
#define CAN_RFDTH1_RFDT6_Pos                (16U)
#define CAN_RFDTH1_RFDT6_Msk                (0xFFU << CAN_RFDTH1_RFDT6_Pos)         /*!< 0x00FF0000 */
#define CAN_RFDTH1_RFDT6                    CAN_RFDTH1_RFDT6_Msk                    /*!< Receive FIFO data byte 6 */
#define CAN_RFDTH1_RFDT7_Pos                (24U)
#define CAN_RFDTH1_RFDT7_Msk                (0xFFU << CAN_RFDTH1_RFDT7_Pos)         /*!< 0xFF000000 */
#define CAN_RFDTH1_RFDT7                    CAN_RFDTH1_RFDT7_Msk                    /*!< Receive FIFO data byte 7 */

/*!< CAN filter registers */
/******************  Bit definition for CAN_FCTRL register  *******************/
#define CAN_FCTRL_FCS_Pos                   (0U)
#define CAN_FCTRL_FCS_Msk                   (0x1U << CAN_FCTRL_FCS_Pos)             /*!< 0x00000001 */
#define CAN_FCTRL_FCS                       CAN_FCTRL_FCS_Msk                       /*!< Filter configuration switch */

/******************  Bit definition for CAN_FMCFG register  *******************/
#define CAN_FMCFG_FMSEL_Pos                 (0U)
#define CAN_FMCFG_FMSEL_Msk                 (0x3FFFU << CAN_FMCFG_FMSEL_Pos)        /*!< 0x00003FFF */
#define CAN_FMCFG_FMSEL                     CAN_FMCFG_FMSEL_Msk                     /*!< Filter mode select */
#define CAN_FMCFG_FMSEL0_Pos                (0U)
#define CAN_FMCFG_FMSEL0_Msk                (0x1U << CAN_FMCFG_FMSEL0_Pos)          /*!< 0x00000001 */
#define CAN_FMCFG_FMSEL0                    CAN_FMCFG_FMSEL0_Msk                    /*!< Filter mode select for filter 0 */
#define CAN_FMCFG_FMSEL1_Pos                (1U)
#define CAN_FMCFG_FMSEL1_Msk                (0x1U << CAN_FMCFG_FMSEL1_Pos)          /*!< 0x00000002 */
#define CAN_FMCFG_FMSEL1                    CAN_FMCFG_FMSEL1_Msk                    /*!< Filter mode select for filter 1 */
#define CAN_FMCFG_FMSEL2_Pos                (2U)
#define CAN_FMCFG_FMSEL2_Msk                (0x1U << CAN_FMCFG_FMSEL2_Pos)          /*!< 0x00000004 */
#define CAN_FMCFG_FMSEL2                    CAN_FMCFG_FMSEL2_Msk                    /*!< Filter mode select for filter 2 */
#define CAN_FMCFG_FMSEL3_Pos                (3U)
#define CAN_FMCFG_FMSEL3_Msk                (0x1U << CAN_FMCFG_FMSEL3_Pos)          /*!< 0x00000008 */
#define CAN_FMCFG_FMSEL3                    CAN_FMCFG_FMSEL3_Msk                    /*!< Filter mode select for filter 3 */
#define CAN_FMCFG_FMSEL4_Pos                (4U)
#define CAN_FMCFG_FMSEL4_Msk                (0x1U << CAN_FMCFG_FMSEL4_Pos)          /*!< 0x00000010 */
#define CAN_FMCFG_FMSEL4                    CAN_FMCFG_FMSEL4_Msk                    /*!< Filter mode select for filter 4 */
#define CAN_FMCFG_FMSEL5_Pos                (5U)
#define CAN_FMCFG_FMSEL5_Msk                (0x1U << CAN_FMCFG_FMSEL5_Pos)          /*!< 0x00000020 */
#define CAN_FMCFG_FMSEL5                    CAN_FMCFG_FMSEL5_Msk                    /*!< Filter mode select for filter 5 */
#define CAN_FMCFG_FMSEL6_Pos                (6U)
#define CAN_FMCFG_FMSEL6_Msk                (0x1U << CAN_FMCFG_FMSEL6_Pos)          /*!< 0x00000040 */
#define CAN_FMCFG_FMSEL6                    CAN_FMCFG_FMSEL6_Msk                    /*!< Filter mode select for filter 6 */
#define CAN_FMCFG_FMSEL7_Pos                (7U)
#define CAN_FMCFG_FMSEL7_Msk                (0x1U << CAN_FMCFG_FMSEL7_Pos)          /*!< 0x00000080 */
#define CAN_FMCFG_FMSEL7                    CAN_FMCFG_FMSEL7_Msk                    /*!< Filter mode select for filter 7 */
#define CAN_FMCFG_FMSEL8_Pos                (8U)
#define CAN_FMCFG_FMSEL8_Msk                (0x1U << CAN_FMCFG_FMSEL8_Pos)          /*!< 0x00000100 */
#define CAN_FMCFG_FMSEL8                    CAN_FMCFG_FMSEL8_Msk                    /*!< Filter mode select for filter 8 */
#define CAN_FMCFG_FMSEL9_Pos                (9U)
#define CAN_FMCFG_FMSEL9_Msk                (0x1U << CAN_FMCFG_FMSEL9_Pos)          /*!< 0x00000200 */
#define CAN_FMCFG_FMSEL9                    CAN_FMCFG_FMSEL9_Msk                    /*!< Filter mode select for filter 9 */
#define CAN_FMCFG_FMSEL10_Pos               (10U)
#define CAN_FMCFG_FMSEL10_Msk               (0x1U << CAN_FMCFG_FMSEL10_Pos)         /*!< 0x00000400 */
#define CAN_FMCFG_FMSEL10                   CAN_FMCFG_FMSEL10_Msk                   /*!< Filter mode select for filter 10 */
#define CAN_FMCFG_FMSEL11_Pos               (11U)
#define CAN_FMCFG_FMSEL11_Msk               (0x1U << CAN_FMCFG_FMSEL11_Pos)         /*!< 0x00000800 */
#define CAN_FMCFG_FMSEL11                   CAN_FMCFG_FMSEL11_Msk                   /*!< Filter mode select for filter 11 */
#define CAN_FMCFG_FMSEL12_Pos               (12U)
#define CAN_FMCFG_FMSEL12_Msk               (0x1U << CAN_FMCFG_FMSEL12_Pos)         /*!< 0x00001000 */
#define CAN_FMCFG_FMSEL12                   CAN_FMCFG_FMSEL12_Msk                   /*!< Filter mode select for filter 12 */
#define CAN_FMCFG_FMSEL13_Pos               (13U)
#define CAN_FMCFG_FMSEL13_Msk               (0x1U << CAN_FMCFG_FMSEL13_Pos)         /*!< 0x00002000 */
#define CAN_FMCFG_FMSEL13                   CAN_FMCFG_FMSEL13_Msk                   /*!< Filter mode select for filter 13 */

/******************  Bit definition for CAN_FBWCFG register  ******************/
#define CAN_FBWCFG_FBWSEL_Pos               (0U)
#define CAN_FBWCFG_FBWSEL_Msk               (0x3FFFU << CAN_FBWCFG_FBWSEL_Pos)      /*!< 0x00003FFF */
#define CAN_FBWCFG_FBWSEL                   CAN_FBWCFG_FBWSEL_Msk                   /*!< Filter bit width select */
#define CAN_FBWCFG_FBWSEL0_Pos              (0U)
#define CAN_FBWCFG_FBWSEL0_Msk              (0x1U << CAN_FBWCFG_FBWSEL0_Pos)        /*!< 0x00000001 */
#define CAN_FBWCFG_FBWSEL0                  CAN_FBWCFG_FBWSEL0_Msk                  /*!< Filter bit width select for filter 0 */
#define CAN_FBWCFG_FBWSEL1_Pos              (1U)
#define CAN_FBWCFG_FBWSEL1_Msk              (0x1U << CAN_FBWCFG_FBWSEL1_Pos)        /*!< 0x00000002 */
#define CAN_FBWCFG_FBWSEL1                  CAN_FBWCFG_FBWSEL1_Msk                  /*!< Filter bit width select for filter 1 */
#define CAN_FBWCFG_FBWSEL2_Pos              (2U)
#define CAN_FBWCFG_FBWSEL2_Msk              (0x1U << CAN_FBWCFG_FBWSEL2_Pos)        /*!< 0x00000004 */
#define CAN_FBWCFG_FBWSEL2                  CAN_FBWCFG_FBWSEL2_Msk                  /*!< Filter bit width select for filter 2 */
#define CAN_FBWCFG_FBWSEL3_Pos              (3U)
#define CAN_FBWCFG_FBWSEL3_Msk              (0x1U << CAN_FBWCFG_FBWSEL3_Pos)        /*!< 0x00000008 */
#define CAN_FBWCFG_FBWSEL3                  CAN_FBWCFG_FBWSEL3_Msk                  /*!< Filter bit width select for filter 3 */
#define CAN_FBWCFG_FBWSEL4_Pos              (4U)
#define CAN_FBWCFG_FBWSEL4_Msk              (0x1U << CAN_FBWCFG_FBWSEL4_Pos)        /*!< 0x00000010 */
#define CAN_FBWCFG_FBWSEL4                  CAN_FBWCFG_FBWSEL4_Msk                  /*!< Filter bit width select for filter 4 */
#define CAN_FBWCFG_FBWSEL5_Pos              (5U)
#define CAN_FBWCFG_FBWSEL5_Msk              (0x1U << CAN_FBWCFG_FBWSEL5_Pos)        /*!< 0x00000020 */
#define CAN_FBWCFG_FBWSEL5                  CAN_FBWCFG_FBWSEL5_Msk                  /*!< Filter bit width select for filter 5 */
#define CAN_FBWCFG_FBWSEL6_Pos              (6U)
#define CAN_FBWCFG_FBWSEL6_Msk              (0x1U << CAN_FBWCFG_FBWSEL6_Pos)        /*!< 0x00000040 */
#define CAN_FBWCFG_FBWSEL6                  CAN_FBWCFG_FBWSEL6_Msk                  /*!< Filter bit width select for filter 6 */
#define CAN_FBWCFG_FBWSEL7_Pos              (7U)
#define CAN_FBWCFG_FBWSEL7_Msk              (0x1U << CAN_FBWCFG_FBWSEL7_Pos)        /*!< 0x00000080 */
#define CAN_FBWCFG_FBWSEL7                  CAN_FBWCFG_FBWSEL7_Msk                  /*!< Filter bit width select for filter 7 */
#define CAN_FBWCFG_FBWSEL8_Pos              (8U)
#define CAN_FBWCFG_FBWSEL8_Msk              (0x1U << CAN_FBWCFG_FBWSEL8_Pos)        /*!< 0x00000100 */
#define CAN_FBWCFG_FBWSEL8                  CAN_FBWCFG_FBWSEL8_Msk                  /*!< Filter bit width select for filter 8 */
#define CAN_FBWCFG_FBWSEL9_Pos              (9U)
#define CAN_FBWCFG_FBWSEL9_Msk              (0x1U << CAN_FBWCFG_FBWSEL9_Pos)        /*!< 0x00000200 */
#define CAN_FBWCFG_FBWSEL9                  CAN_FBWCFG_FBWSEL9_Msk                  /*!< Filter bit width select for filter 9 */
#define CAN_FBWCFG_FBWSEL10_Pos             (10U)
#define CAN_FBWCFG_FBWSEL10_Msk             (0x1U << CAN_FBWCFG_FBWSEL10_Pos)       /*!< 0x00000400 */
#define CAN_FBWCFG_FBWSEL10                 CAN_FBWCFG_FBWSEL10_Msk                 /*!< Filter bit width select for filter 10 */
#define CAN_FBWCFG_FBWSEL11_Pos             (11U)
#define CAN_FBWCFG_FBWSEL11_Msk             (0x1U << CAN_FBWCFG_FBWSEL11_Pos)       /*!< 0x00000800 */
#define CAN_FBWCFG_FBWSEL11                 CAN_FBWCFG_FBWSEL11_Msk                 /*!< Filter bit width select for filter 11 */
#define CAN_FBWCFG_FBWSEL12_Pos             (12U)
#define CAN_FBWCFG_FBWSEL12_Msk             (0x1U << CAN_FBWCFG_FBWSEL12_Pos)       /*!< 0x00001000 */
#define CAN_FBWCFG_FBWSEL12                 CAN_FBWCFG_FBWSEL12_Msk                 /*!< Filter bit width select for filter 12 */
#define CAN_FBWCFG_FBWSEL13_Pos             (13U)
#define CAN_FBWCFG_FBWSEL13_Msk             (0x1U << CAN_FBWCFG_FBWSEL13_Pos)       /*!< 0x00002000 */
#define CAN_FBWCFG_FBWSEL13                 CAN_FBWCFG_FBWSEL13_Msk                 /*!< Filter bit width select for filter 13 */

/*******************  Bit definition for CAN_FRF register  ********************/
#define CAN_FRF_FRFSEL_Pos                  (0U)
#define CAN_FRF_FRFSEL_Msk                  (0x3FFFU << CAN_FRF_FRFSEL_Pos)         /*!< 0x00003FFF */
#define CAN_FRF_FRFSEL                      CAN_FRF_FRFSEL_Msk                      /*!< Filter relation FIFO select */
#define CAN_FRF_FRFSEL0_Pos                 (0U)
#define CAN_FRF_FRFSEL0_Msk                 (0x1U << CAN_FRF_FRFSEL0_Pos)           /*!< 0x00000001 */
#define CAN_FRF_FRFSEL0                     CAN_FRF_FRFSEL0_Msk                     /*!< Filter relation FIFO select for filter 0 */
#define CAN_FRF_FRFSEL1_Pos                 (1U)
#define CAN_FRF_FRFSEL1_Msk                 (0x1U << CAN_FRF_FRFSEL1_Pos)           /*!< 0x00000002 */
#define CAN_FRF_FRFSEL1                     CAN_FRF_FRFSEL1_Msk                     /*!< Filter relation FIFO select for filter 1 */
#define CAN_FRF_FRFSEL2_Pos                 (2U)
#define CAN_FRF_FRFSEL2_Msk                 (0x1U << CAN_FRF_FRFSEL2_Pos)           /*!< 0x00000004 */
#define CAN_FRF_FRFSEL2                     CAN_FRF_FRFSEL2_Msk                     /*!< Filter relation FIFO select for filter 2 */
#define CAN_FRF_FRFSEL3_Pos                 (3U)
#define CAN_FRF_FRFSEL3_Msk                 (0x1U << CAN_FRF_FRFSEL3_Pos)           /*!< 0x00000008 */
#define CAN_FRF_FRFSEL3                     CAN_FRF_FRFSEL3_Msk                     /*!< Filter relation FIFO select for filter 3 */
#define CAN_FRF_FRFSEL4_Pos                 (4U)
#define CAN_FRF_FRFSEL4_Msk                 (0x1U << CAN_FRF_FRFSEL4_Pos)           /*!< 0x00000010 */
#define CAN_FRF_FRFSEL4                     CAN_FRF_FRFSEL4_Msk                     /*!< Filter relation FIFO select for filter 4 */
#define CAN_FRF_FRFSEL5_Pos                 (5U)
#define CAN_FRF_FRFSEL5_Msk                 (0x1U << CAN_FRF_FRFSEL5_Pos)           /*!< 0x00000020 */
#define CAN_FRF_FRFSEL5                     CAN_FRF_FRFSEL5_Msk                     /*!< Filter relation FIFO select for filter 5 */
#define CAN_FRF_FRFSEL6_Pos                 (6U)
#define CAN_FRF_FRFSEL6_Msk                 (0x1U << CAN_FRF_FRFSEL6_Pos)           /*!< 0x00000040 */
#define CAN_FRF_FRFSEL6                     CAN_FRF_FRFSEL6_Msk                     /*!< Filter relation FIFO select for filter 6 */
#define CAN_FRF_FRFSEL7_Pos                 (7U)
#define CAN_FRF_FRFSEL7_Msk                 (0x1U << CAN_FRF_FRFSEL7_Pos)           /*!< 0x00000080 */
#define CAN_FRF_FRFSEL7                     CAN_FRF_FRFSEL7_Msk                     /*!< Filter relation FIFO select for filter 7 */
#define CAN_FRF_FRFSEL8_Pos                 (8U)
#define CAN_FRF_FRFSEL8_Msk                 (0x1U << CAN_FRF_FRFSEL8_Pos)           /*!< 0x00000100 */
#define CAN_FRF_FRFSEL8                     CAN_FRF_FRFSEL8_Msk                     /*!< Filter relation FIFO select for filter 8 */
#define CAN_FRF_FRFSEL9_Pos                 (9U)
#define CAN_FRF_FRFSEL9_Msk                 (0x1U << CAN_FRF_FRFSEL9_Pos)           /*!< 0x00000200 */
#define CAN_FRF_FRFSEL9                     CAN_FRF_FRFSEL9_Msk                     /*!< Filter relation FIFO select for filter 9 */
#define CAN_FRF_FRFSEL10_Pos                (10U)
#define CAN_FRF_FRFSEL10_Msk                (0x1U << CAN_FRF_FRFSEL10_Pos)          /*!< 0x00000400 */
#define CAN_FRF_FRFSEL10                    CAN_FRF_FRFSEL10_Msk                    /*!< Filter relation FIFO select for filter 10 */
#define CAN_FRF_FRFSEL11_Pos                (11U)
#define CAN_FRF_FRFSEL11_Msk                (0x1U << CAN_FRF_FRFSEL11_Pos)          /*!< 0x00000800 */
#define CAN_FRF_FRFSEL11                    CAN_FRF_FRFSEL11_Msk                    /*!< Filter relation FIFO select for filter 11 */
#define CAN_FRF_FRFSEL12_Pos                (12U)
#define CAN_FRF_FRFSEL12_Msk                (0x1U << CAN_FRF_FRFSEL12_Pos)          /*!< 0x00001000 */
#define CAN_FRF_FRFSEL12                    CAN_FRF_FRFSEL12_Msk                    /*!< Filter relation FIFO select for filter 12 */
#define CAN_FRF_FRFSEL13_Pos                (13U)
#define CAN_FRF_FRFSEL13_Msk                (0x1U << CAN_FRF_FRFSEL13_Pos)          /*!< 0x00002000 */
#define CAN_FRF_FRFSEL13                    CAN_FRF_FRFSEL13_Msk                    /*!< Filter relation FIFO select for filter 13 */

/******************  Bit definition for CAN_FACFG register  *******************/
#define CAN_FACFG_FAEN_Pos                  (0U)
#define CAN_FACFG_FAEN_Msk                  (0x3FFFU << CAN_FACFG_FAEN_Pos)         /*!< 0x00003FFF */
#define CAN_FACFG_FAEN                      CAN_FACFG_FAEN_Msk                      /*!< Filter active enable */
#define CAN_FACFG_FAEN0_Pos                 (0U)
#define CAN_FACFG_FAEN0_Msk                 (0x1U << CAN_FACFG_FAEN0_Pos)           /*!< 0x00000001 */
#define CAN_FACFG_FAEN0                     CAN_FACFG_FAEN0_Msk                     /*!< Filter 0 active enable */
#define CAN_FACFG_FAEN1_Pos                 (1U)
#define CAN_FACFG_FAEN1_Msk                 (0x1U << CAN_FACFG_FAEN1_Pos)           /*!< 0x00000002 */
#define CAN_FACFG_FAEN1                     CAN_FACFG_FAEN1_Msk                     /*!< Filter 1 active enable */
#define CAN_FACFG_FAEN2_Pos                 (2U)
#define CAN_FACFG_FAEN2_Msk                 (0x1U << CAN_FACFG_FAEN2_Pos)           /*!< 0x00000004 */
#define CAN_FACFG_FAEN2                     CAN_FACFG_FAEN2_Msk                     /*!< Filter 2 active enable */
#define CAN_FACFG_FAEN3_Pos                 (3U)
#define CAN_FACFG_FAEN3_Msk                 (0x1U << CAN_FACFG_FAEN3_Pos)           /*!< 0x00000008 */
#define CAN_FACFG_FAEN3                     CAN_FACFG_FAEN3_Msk                     /*!< Filter 3 active enable */
#define CAN_FACFG_FAEN4_Pos                 (4U)
#define CAN_FACFG_FAEN4_Msk                 (0x1U << CAN_FACFG_FAEN4_Pos)           /*!< 0x00000010 */
#define CAN_FACFG_FAEN4                     CAN_FACFG_FAEN4_Msk                     /*!< Filter 4 active enable */
#define CAN_FACFG_FAEN5_Pos                 (5U)
#define CAN_FACFG_FAEN5_Msk                 (0x1U << CAN_FACFG_FAEN5_Pos)           /*!< 0x00000020 */
#define CAN_FACFG_FAEN5                     CAN_FACFG_FAEN5_Msk                     /*!< Filter 5 active enable */
#define CAN_FACFG_FAEN6_Pos                 (6U)
#define CAN_FACFG_FAEN6_Msk                 (0x1U << CAN_FACFG_FAEN6_Pos)           /*!< 0x00000040 */
#define CAN_FACFG_FAEN6                     CAN_FACFG_FAEN6_Msk                     /*!< Filter 6 active enable */
#define CAN_FACFG_FAEN7_Pos                 (7U)
#define CAN_FACFG_FAEN7_Msk                 (0x1U << CAN_FACFG_FAEN7_Pos)           /*!< 0x00000080 */
#define CAN_FACFG_FAEN7                     CAN_FACFG_FAEN7_Msk                     /*!< Filter 7 active enable */
#define CAN_FACFG_FAEN8_Pos                 (8U)
#define CAN_FACFG_FAEN8_Msk                 (0x1U << CAN_FACFG_FAEN8_Pos)           /*!< 0x00000100 */
#define CAN_FACFG_FAEN8                     CAN_FACFG_FAEN8_Msk                     /*!< Filter 8 active enable */
#define CAN_FACFG_FAEN9_Pos                 (9U)
#define CAN_FACFG_FAEN9_Msk                 (0x1U << CAN_FACFG_FAEN9_Pos)           /*!< 0x00000200 */
#define CAN_FACFG_FAEN9                     CAN_FACFG_FAEN9_Msk                     /*!< Filter 9 active enable */
#define CAN_FACFG_FAEN10_Pos                (10U)
#define CAN_FACFG_FAEN10_Msk                (0x1U << CAN_FACFG_FAEN10_Pos)          /*!< 0x00000400 */
#define CAN_FACFG_FAEN10                    CAN_FACFG_FAEN10_Msk                    /*!< Filter 10 active enable */
#define CAN_FACFG_FAEN11_Pos                (11U)
#define CAN_FACFG_FAEN11_Msk                (0x1U << CAN_FACFG_FAEN11_Pos)          /*!< 0x00000800 */
#define CAN_FACFG_FAEN11                    CAN_FACFG_FAEN11_Msk                    /*!< Filter 11 active enable */
#define CAN_FACFG_FAEN12_Pos                (12U)
#define CAN_FACFG_FAEN12_Msk                (0x1U << CAN_FACFG_FAEN12_Pos)          /*!< 0x00001000 */
#define CAN_FACFG_FAEN12                    CAN_FACFG_FAEN12_Msk                    /*!< Filter 12 active enable */
#define CAN_FACFG_FAEN13_Pos                (13U)
#define CAN_FACFG_FAEN13_Msk                (0x1U << CAN_FACFG_FAEN13_Pos)          /*!< 0x00002000 */
#define CAN_FACFG_FAEN13                    CAN_FACFG_FAEN13_Msk                    /*!< Filter 13 active enable */

